
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 6 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]
  * module.api_mgmt_product.azurerm_api_management_product.product
* Replace
  * module.api_mgmt.azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-30T12:45:53Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE/8fcfcc7568314980a0d149fde7581330"
        name                    = "blob-router-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-30T12:45:53Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-HOST/ed980219a91e4a53a32550c8b91bdffb"
        name                    = "blob-router-POSTGRES-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-30T12:45:53Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PASS/8eb8d92035ca4a98b659a9592856d9a7"
        name                    = "blob-router-POSTGRES-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-30T12:45:53Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PORT/625ba64f902c483f8454541197005db0"
        name                    = "blob-router-POSTGRES-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-30T12:45:53Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-USER/3ee7881662a042839db61e23d65df6bb"
        name                    = "blob-router-POSTGRES-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # module.api_mgmt.azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/apis/bulk-scan-api;rev=1" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "bulk-scan-api"
      ~ revision              = "1" -> "2" # forces replacement
      ~ soap_pass_through     = false -> (known after apply)
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (12 unchanged attributes hidden)

      ~ subscription_key_parameter_names {
          + api_management_name   = (known after apply)
          + api_type              = (known after apply)
          + description           = (known after apply)
          + display_name          = (known after apply)
          + id                    = (known after apply)
          + is_current            = (known after apply)
          + is_online             = (known after apply)
          + name                  = (known after apply)
          + path                  = (known after apply)
          + protocols             = (known after apply)
          + resource_group_name   = (known after apply)
          + revision              = (known after apply)
          + revision_description  = (known after apply)
          + service_url           = (known after apply)
          + soap_pass_through     = (known after apply)
          + source_api_id         = (known after apply)
          + subscription_required = (known after apply)
          + terms_of_service_url  = (known after apply)
          + version               = (known after apply)
          + version_description   = (known after apply)
          + version_set_id        = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/products/bulk-scan"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2291,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->